

/*===========================================================================
  問1:isEven関数を実行して、以下の配列から偶数だけが出力されるように実装してください。
=============================================================================*/

    let numbers = [2 , 5 , 12 , 13 , 15 , 18 , 22] ;

    function isEven(num){
      for(i=0 ; i < numbers.length ; i++ ){
          if(numbers[i] % 2 === 0){
            num = numbers[i] ;
            console.log(num + 'は偶数です');
          }
        } 
      }

    isEven();



    /*===========================================================================
  ・インスタンス化した時にガソリンとナンバーがセットされるようなCarクラスを作成する

・「ガソリンは〇〇です。ナンバーは△△です」と出力される「getNumGas」という関数を作成する
=============================================================================*/

      class car{
        constructor(name , number){
          this.name = name ;
          this.number = number ;
        }
        getNumGas(){
          console.log(`ガソリンは${this.name}です`);
          console.log(`ナンバーは${this.number}です`);
          
        }
      }

      let car_new = new car('ハイオク' , 1234);
      car_new.getNumGas();